Table of Contents
 Class ConcreteMemberData
Namespace
IdeaRS.OpenModel.Concrete
Assembly
IdeaRS.OpenModel.dll
Concrete member data base
public abstract class ConcreteMemberData : OpenAttribute
Inheritance
object
OpenObject
OpenAttribute
ConcreteMemberData
Derived
ConcreteMemberDataEc2
Inherited Members
 OpenAttribute.Element
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 ConcreteMemberData()
Constructor
public ConcreteMemberData()
Properties
 CalculationSetup
Calculation setup
public CalculationSetup CalculationSetup { get; set; }
Property Value
CalculationSetup
 MemberType
Gets or sets the structural type of member.
public ConcreteMemberType MemberType { get; set; }
Property Value
ConcreteMemberType
 TimeAxis
Time axis
public TimeAxis TimeAxis { get; set; }
Property Value
TimeAxis
 TwoWaySlabType
two way slab type
public TwoWaySlabType TwoWaySlabType { get; set; }
Property Value
TwoWaySlabType
 Edit this page